backend/app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def current_user
      token = request.env["HTTP_AUTHORIZATION"]

      if token != 'undefined'
        return @current_user ||= User.find(Auth.decode_token(token).first["user"]["id"]) if token