backend/app/controllers/kits_controller.rb

SELECT "kits".* FROM "kits"
---
    def index

            render json: Kit.all