backend/app/controllers/selections_controller.rb

    def show
        selection = Selection.find_by(:id => specific_selection_param[:id].to_i)
---
SELECT "selections".* FROM "selections" WHERE "selections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]