backend/app/controllers/selections_controller.rb

INSERT INTO "selections" ("user_id", "kit_id", "public", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "1"], ["kit_id", "1"], ["public", 1], ["created_at", "2020-03-15 14:08:24.279252"], ["updated_at", "2020-03-15 14:08:24.279252"]]
INSERT INTO "themes" ("api_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["api_id", "667"], ["name", "Fantastic Beasts"], ["created_at", "2020-03-15 15:49:04.510004"], ["updated_at", "2020-03-15 15:49:04.510004"]]
INSERT INTO "kits" ("name", "set_img_url", "theme_id", "set_num", "year", "set_url", "last_modified_dt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "kits" SET "theme_id" = ?, "updated_at" = ? WHERE "kits"."id" = ?  [["theme_id", "8"], ["updated_at", "2020-03-15 16:11:48.400516"], ["id", 9]]
---
    def create


        allowpublic = (selection_permission_params[:isPublic] == "true" ? true : false)
        selection_theme = Theme.find_or_create_by(selection_theme_params)


        if found_kit = Kit.find_by(:set_num => selection_kit_params[:set_num])
            selected_kit = found_kit
        else
            selected_kit = Kit.create(selection_kit_params)
            selected_kit.theme = selection_theme
            selected_kit.save

SELECT "selections".* FROM "selections" WHERE "selections"."user_id" = ?  [["user_id", "1"]]
---
    def index
        collection = current_user.selections

SELECT "selections".* FROM "selections" WHERE "selections"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        selection = Selection.find_by(:id => specific_selection_param[:id].to_i)