backend/app/controllers/users_controller.rb

    def create


        user = User.new(userParams)

        if user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Louise"], ["password_digest", "$2a$12$q.1CoNm4hdcMja9UD6NpzeZbJ2KHs3dkWd/GpSSrkswHOHHQiIxPW"], ["created_at", "2020-02-28 18:48:05.598290"], ["updated_at", "2020-02-28 18:48:05.598290"]]